/*******************************************
	ACC_24XX.C	updated at 19th May 1989
	数字＋助数詞のアクセント決定ルーチン
 *******************************************/

#define		EXT		extern

#include	"onsei.h"
#include	"ile_acch.h"
#include	"ile_shdh.h"
#include	"ile_stch.h"
#include	"ile_stzh.h"
#include	"ile_func.h"


/****************************************************************************/
/*																			*/
/*			ここから下は、数字＋助数詞のアクセント決定ルーチン				*/
/*																			*/
/****************************************************************************/

/*========== ACC2410(p,q) ================================================
	機能：ｑ番目の助数詞は、ｐ番目の数字と相互影響して、１型の結合をする

	　即ち、数字は平板化し、助数詞は高く付き、全体は平板型になる。
  ========================================================================*/
void ACC2410(p,q) register integer_16 p,q; {
	ACC000H(p); ACC0005(q);
}

/*========== ACC2411(p,q) ==================================================
	機能：ｑ番目の助数詞は、ｐ番目の数字と相互影響して、１１型の結合をする

	　即ち、数字は平板化し、助数詞は高く付き、全体は平板型になる。
	　但し、数字が三・四・五・七・九・十の倍数のときは、数字は尾高化し、
		助数詞は低く付く。
		三・四・九の場合は、撥音・長音の影響で一拍前に移動する。

	　十・百の倍数は尾高化する。
	　十万・百万・千万・十億・百億・千億・十兆・百兆・千兆の倍数は
	最後の拍が落ちる中高型となる。
  ==========================================================================*/
void ACC2411(p,q) integer_16 p,q; 
{
	register integer_16 a1,am; 
	integer_16 ae;
	am=stc_dman[p]; 
	ae=stc_dexp[p]; 
	a1=am*100+ae;
	
	/* 複合数字でかつ一の位が０以外なら尾高化する。*/
	if(ae==0 && am<=12 && p>0 && stc_kind[p-1]==DICKIND_D)
	{
		goto ACC2411_ODAKA;
	}
	if(ae==3||ae==4||ae==8||ae==12){ goto ACC2411_HEIBAN; }
	if((ae==1||ae==2)&& am>=1){ goto ACC2411_ODAKA; }	/* 20,200 */
	if(ae>=5 && am>=1){ goto ACC2411_NAKADAKA; } /* 20万,200万,2000万,20億..*/
	
	switch(a1){
	case 300: case 400: case 500: case 700: case 900:
		goto ACC2411_ODAKA;
	default:
		goto ACC2411_HEIBAN;
	}
	
ACC2411_ODAKA:
	ACC0002(p); 
	ACC0004(q); 
	return;
ACC2411_NAKADAKA:
	ACC0002(p);
	accent0[stc_out_ptr[q]-1]=1;
	accent0[stc_out_ptr[q]-2]=0x82;
	ACC0004(q); 
	return;
ACC2411_HEIBAN:
	ACC000H(p); 
	ACC0005(q); 
	return;
}

/*========== ACC2412(p,q) ==================================================
	機能：ｑ番目の助数詞は、ｐ番目の数字と相互影響して、１２型の結合をする

	　即ち、数字は平板化し、助数詞は高く付き、全体は平板型になる。
	　但し、数字が十一〜十九・十の倍数・百の倍数・千の倍数のときは、
	数字は平板化し助数詞は頭高になる。
  ==========================================================================*/
void ACC2412(p,q) integer_16 p,q; 
{
	register integer_16 am; 
	integer_16 ae;
	am=stc_dman[p]; ae=stc_dexp[p];

	ACC000H(p);
	if(am<=9 && ae==0 && stc_out_len[p]>2){ goto ACC2412_100; } /* 11..19 */
	if(ae>=1 && ae<=3 && am>1){ goto ACC2412_100; }	/* 十・百・千の倍数 */

	ACC0005(q); return;
ACC2412_100:;
	ACC0001(q);
}

/*========== ACC2413(p,q) ==================================================
	機能：ｑ番目の助数詞は、ｐ番目の数字と相互影響して、１３型の結合をする

	　即ち、数字は平板化し、助数詞は高く付き、全体は平板型になる。
	　但し、数字が十一〜十九・十の倍数・百の倍数・千の倍数のときは、
	数字は平板化し助数詞は低く付き、数字の最終拍がモーラ音素のときは、
	滝が一拍前に移動する。
  ==========================================================================*/
void ACC2413(p,q) integer_16 p,q; 
{
	register integer_16 pp,pl;
	ACC2412(p,q);
	/* 最終拍がア行のとき、アクセント核を１拍ずらす。*/
	pp=phrase_ptr[p]; 
	pl=phrase_len[p];
	if((omega[pp+pl-1] & 0xF8)==0x00)
	{
		accent0[pp+pl-1]=1; 
		accent0[pp+pl-2]=0x82;
	}
}

/*========== ACC2420(p,q) ================================================
	機能：ｑ番目の助数詞は、ｐ番目の数字と相互影響して、２型の結合をする

	  即ち、数字は平板化し、助数詞は高く付き、全体は尾高型になる。
	但し、千の倍数は平板化する。
  ========================================================================*/
void ACC2420(p,q) integer_16 p,q; 
{
	register integer_16 qp,ql;
	qp=phrase_ptr[q]; 
	ql=phrase_len[q];
	ACC000H(p); 
	ACC0005(q);
	accent0[qp+ql-1]= (stc_dman[p]>=1 && stc_dexp[p]==3 ? 2:0x82);
}

/*========== ACC2421(p,q) ==================================================
	機能：ｑ番目の助数詞は、ｐ番目の数字と相互影響して、２１型の結合をする

	　即ち、数字は平板化し、助数詞は高く付き、全体は尾高型になる。
	　但し、数字が三・四・七・十の倍数・百の倍数のとき、数字は尾高化し、
		助数詞は低く付く。
		三・四の場合は、撥音・長音の影響で一拍前に移動する。
		十の倍数・百の倍数が促音化する場合も同じ。
  ==========================================================================*/
void ACC2421(p,q) integer_16 p,q; 
{
	register integer_16 a1,am; integer_16 ae,qp,ql;
	am=stc_dman[p]; ae=stc_dexp[p]; a1=am*100+ae;
	if(ae==1 && am>1){ goto ACC2421_100; }	/* 20..90 */
	if(ae==2 && am>1){ goto ACC2421_100; }	/* 200..900 */
	switch(a1)
	{
	case 300: case 400: case 700:
		goto ACC2421_100;
	default:
		qp=phrase_ptr[q]; 
		ql=phrase_len[q];
		ACC000H(p); 
		ACC0005(q);
		accent0[qp+ql-1]= (am>1 && ae==3 ? 2:0x82);
		return;
	}
	
ACC2421_100:
	ACC0002(p); 
	ACC0004(q);
}

/*========== ACC2422(p,q) ====================================================
	機能：ｑ番目の助数詞は、ｐ番目の数字と相互影響して、２２型の結合をする

	　即ち、数字は平板化し、助数詞は高く付き、全体は尾高型になる。
	　但し、数字が三・四・六・七・八・九・十・十の倍数のとき、数字は尾高化し、
		助数詞は低く付く。
		三・四・九・十の場合は、撥音・長音の影響で一拍前に移動する。
		十の倍数が促音化する場合も同じ。
  ============================================================================*/
void ACC2422(p,q) integer_16 p,q; 
{
	register integer_16 a1,am; 
	integer_16 ae,qp,ql;
	am=stc_dman[p]; 
	ae=stc_dexp[p]; 
	a1=am*100+ae;
	if(ae==1){ goto ACC2422_100; }	/* 10, 20..90 */
	switch(a1)
	{
	case 300: case 400: case 600: case 700: case 800: case 900:
		goto ACC2422_100;
	default:
		qp=phrase_ptr[q]; ql=phrase_len[q];
		ACC000H(p); ACC0005(q);
		accent0[qp+ql-1]= (am>1 && ae==3 ? 2:0x82);
		return;
	}
	
ACC2422_100:
	ACC0002(p); 
	ACC0004(q);
}

/*========== ACC2423(p,q) ==================================================
	機能：ｑ番目の助数詞は、ｐ番目の数字と相互影響して、２３型の結合をする

	　即ち、数字は平板化し、助数詞は高く付き、全体は尾高型になる。
	　但し、数字が二・三・四・五・七・九・十の倍数・百の倍数・千のとき、
		数字は尾高化し、助数詞は低く付く。
		三・四・九・十の場合は、撥音・長音の影響で一拍前に移動する。
		十の倍数が促音化する場合も同じ。
  =========================================================================*/
void ACC2423(p,q) integer_16 p,q; 
{
	register integer_16 a1,am; 
	integer_16 ae,qp,ql;
	am=stc_dman[p]; 
	ae=stc_dexp[p]; 
	a1=am*100+ae;
	if(ae==1 && am>1){ goto ACC2423_100; }	/* 20..90 */
	if(ae==2 && am>1){ goto ACC2423_100; }	/* 200..900 */
	switch(a1)
	{
	case 200: case 300: case 400: case 500: case 700: case 900:
	case 003:			/*  千と一千は区別できるか？ *** problem *** */
		goto ACC2423_100;
	default:
		qp=phrase_ptr[q]; 
		ql=phrase_len[q];
		ACC000H(p); 
		ACC0005(q);
		accent0[qp+ql-1]= (am>1 && ae==3 ? 2:0x82);
		return;
	}
	
ACC2423_100:
	ACC0002(p); 
	ACC0004(q);
}

/*========== ACC2424(p,q) ==================================================
	機能：ｑ番目の助数詞は、ｐ番目の数字と相互影響して、２４型の結合をする

	　即ち、数字は平板化し、助数詞は高く付き、全体は尾高型になる。
	　但し、数字が三・四・五・七・九・十の倍数のときは、数字は尾高化し、
		助数詞は低く付く。
		三・四・九の場合は、撥音・長音の影響で一拍前に移動する。
  ==========================================================================*/
void ACC2424(p,q) integer_16 p,q; {
	register integer_16 a1,am; integer_16 ae,qp,ql;
	am=stc_dman[p]; ae=stc_dexp[p]; a1=am*100+ae;
	if(ae==1 && am>1 && am<=9){ goto ACC2424_100; }	/* 20..90 */
	switch(a1){
	case 300: case 400: case 500: case 700: case 900:
		goto ACC2424_100;
	default:
		qp=phrase_ptr[q]; ql=phrase_len[q];
		ACC000H(p); ACC0005(q);
		accent0[qp+ql-1]= (am>1 && ae==3 ? 2:0x82);
		return;
	}

ACC2424_100:;
	ACC0002(p); ACC0004(q);
}

/*========== ACC2430(p,q) ==================================================
	機能：ｑ番目の助数詞は、ｐ番目の数字と相互影響して、３０型の結合をする

	　即ち、数字は平板化し、助数詞は高く付き、助数詞の滝で落ちる。
  ==========================================================================*/
void ACC2430(p,q,falls) register integer_16 p,q; integer_16 falls; {
	ACC000H(p); ACC0003(q,falls);
	accent0[phrase_ptr[q]]=2;
}

/*========== ACC2440(p,q) ==================================================
	機能：ｑ番目の助数詞は、ｐ番目の数字と相互影響して、４０型の結合をする

	　即ち、数字は平板化し、助数詞は頭高化する。
  ==========================================================================*/
void ACC2440(p,q) register integer_16 p,q; {
	ACC000H(p); ACC0001(q);
}

/*========== ACC2441(p,q) ==================================================
	機能：ｑ番目の助数詞は、ｐ番目の数字と相互影響して、４１型の結合をする

	　即ち、数字は平板化し、助数詞は頭高化する。
	但し、四・七・九・十の倍数・百の倍数・千のときは、数字は尾高化し助数詞は低く付く。
	また、万・億・兆に一〜九・十・百・千・数・何・幾がついた場合は、全体が平板化する。
		（例）回
  ==========================================================================*/
void ACC2441(p,q) integer_16 p,q; {
	register integer_16 a1,am; integer_16 ae;
	am=stc_dman[p]; ae=stc_dexp[p]; a1=am*100+ae;
	if(ae==1 && am>1){ goto ACC2441_200; }	/* 十の倍数 */
	if(ae==2 && am>1){ goto ACC2441_200; }	/* 百の倍数 */
	if(ACC2499(am,ae)){ goto ACC2441_500; }
	switch(a1){
	case 400: case 700: case 900: case 003:
		goto ACC2441_200;
	default:
		ACC000H(p); ACC0001(q); return;
	}

ACC2441_200:;
	ACC0002(p); ACC0004(q); return;
ACC2441_500:;
	ACC000H(p); ACC0005(q);
}

/*========== ACC2442(p,q) ====================================================
	機能：ｑ番目の助数詞は、ｐ番目の数字と相互影響して、４２型の結合をする

	　即ち、数字は平板化し、助数詞は頭高化する。
	但し、三・四・七・九・十の倍数・百の倍数・千のときは、数字は尾高化し助数詞は低く付く。
	また、万・億・兆に一〜九・十・百・千・数・何・幾がついた場合は、全体が平板化する。
		（例）寸
  ============================================================================*/
void ACC2442(p,q) integer_16 p,q; {
	register integer_16 a1,am; integer_16 ae;
	am=stc_dman[p]; ae=stc_dexp[p]; a1=am*100+ae;
	/*if(ae== 1 && am>1){ goto ACC2442_200; }*/	/* 20..90 */
	/*if(ae== 2 && am>1){ goto ACC2442_200; }*/	/* 200..900 */
	if(am>1 && (ae==1||ae==2)){ goto ACC2442_200; }	/* 20..90, 200..900 */
	if(ACC2499(am,ae)){ goto ACC2442_500; }
	switch(a1){
	case 300: case 400: case 700: case 900: case 003:
		goto ACC2442_200;
	default:
		ACC000H(p); ACC0001(q); return;
	}

ACC2442_200:;
	ACC0002(p); ACC0004(q); return;
ACC2442_500:;
	ACC000H(p); ACC0005(q);
}

/*========== ACC2443(p,q) ======================================================
	機能：ｑ番目の助数詞は、ｐ番目の数字と相互影響して、４３型の結合をする

	　即ち、数字は平板化し、助数詞は頭高化する。
	但し、三・四・七・八・九・十・十の倍数・百の倍数・千のときは、数字は尾高化し助数詞は低く付く。
	また、万・億・兆に一〜九・十・百・千・数・何・幾がついた場合は、全体が平板化する。
		（例）合
  ==============================================================================*/
void ACC2443(p,q) integer_16 p,q; {
	register integer_16 a1,am; integer_16 ae;
	am=stc_dman[p]; ae=stc_dexp[p]; a1=am*100+ae;
	/*if(ae== 1 && am>1){ goto ACC2443_200; }*/	/* 20..90 */
	/*if(ae== 2 && am>1){ goto ACC2443_200; }*/	/* 200..900 */
	if(am>1 && (ae==1||ae==2)){ goto ACC2443_200; }	/* 20..90, 200..900 */
	if(ACC2499(am,ae)){ goto ACC2443_500; }
	switch(a1){
	case 300: case 400: case 700: case 800: case 900:
	case 001: case 003:
		goto ACC2443_200;
	default:
		ACC000H(p); ACC0001(q); return;
	}

ACC2443_200:;
	ACC0002(p); ACC0004(q); return;
ACC2443_500:;
	ACC000H(p); ACC0005(q);
}

/*========== ACC2450(p,q) ==================================================
	機能：ｑ番目の助数詞は、ｐ番目の数字と相互影響して、５０型の結合をする

	　即ち、数字は平板化し、助数詞は頭高化する。
	　但し、二・五のとき、数字は尾高化し、助数詞は低く付く。
  ==========================================================================*/
void ACC2450(p,q) integer_16 p,q; {
	register integer_16 a1,am; integer_16 ae;
	am=stc_dman[p]; ae=stc_dexp[p]; a1=am*100+ae;
	switch(a1){
	case 200: case 500:
		ACC0002(p); ACC0004(q); break;
	default:
		ACC000H(p); ACC0001(q);
	}
}

/*========== ACC2460(p,q) ==================================================
	機能：ｑ番目の助数詞は、ｐ番目の数字と相互影響して、６０型の結合をする

	　即ち、数字は尾高化し、助数詞は低く付く。
	　但し、千・万・億・兆に、一〜九・十・百・千・数・何・幾がついた場合には、
	数字は平板化し、助数詞は高く付いて、全体は平板型となる。
	　十万・百万・千万・十億・百億・千億・十兆・百兆・千兆の倍数は
	最後の拍が落ちる中高型となる。
		（例）個・トン
  ==========================================================================*/
void ACC2460(p,q) integer_16 p,q; {
	register integer_16 am,ae;
	am=stc_dman[p]; ae=stc_dexp[p];

	if((ae==3 && am>=1) || ACC2499(am,ae)){
		/* 数字は平板化、助数詞は高く付く。*/
		ACC000H(p); ACC0005(q);
	}else{
		if(ae>=5 && am>=1){
			/* 20万,200万,2000万,20億..*/
			ACC0002(p);
			accent0[stc_out_ptr[q]-1]=1;
			accent0[stc_out_ptr[q]-2]=0x82;
			ACC0004(q);
		}else{
			/* 数字は尾高化、助数詞は低く付く。*/
			ACC0002(p); ACC0004(q);
		}
	}
}

/*========== ACC2461(p,q) ======================================================
	機能：ｑ番目の助数詞は、ｐ番目の数字と相互影響して、６１型の結合をする

	　即ち、数字は尾高化し、助数詞は低く付く。
	　但し、五、及び、千・万・億・兆に、一〜九・十・百・千・数・何・幾がついた場合には、
	数字は平板化し、助数詞は高く付いて、全体は平板型となる。
	　十万・百万・千万・十億・百億・千億・十兆・百兆・千兆の倍数は
	最後の拍が落ちる中高型となる。
  ==============================================================================*/
void ACC2461(p,q) integer_16 p,q; {
	register integer_16 am,ae;
	am=stc_dman[p]; ae=stc_dexp[p];

	if((ae==0 && am==5) || (ae==3 && am>=1) || ACC2499(am,ae)){
		/* 数字は平板化、助数詞は高く付く。*/
		ACC000H(p); ACC0005(q);
	}else{
		if(ae>=5 && am>=1){
			/* 20万,200万,2000万,20億..*/
			ACC0002(p);
			accent0[stc_out_ptr[q]-1]=1;
			accent0[stc_out_ptr[q]-2]=0x82;
			ACC0004(q);
		}else{
			/* 数字は尾高化、助数詞は低く付く。*/
			ACC0002(p); ACC0004(q);
		}
	}
}

/*========== ACC2462(p,q) ==================================================
	機能：ｑ番目の助数詞は、ｐ番目の数字と相互影響して、６２型の結合をする

	　即ち、数字は尾高化し、助数詞は低く付く。
	　但し、千・万・億・兆に、一〜九・十・百・千・数・何・幾がついた場合には、
	数字は平板化し、助数詞は高く付いて、全体は平板型となる。
	　単独または複合した三・四・五・九のときは、数字は平板化し、
	助数詞は頭高化する。但し、十三は例外的に中高である。
	　十万・百万・千万・十億・百億・千億・十兆・百兆・千兆の倍数は
	最後の拍が落ちる中高型となる。
  ==========================================================================*/
void ACC2462(p,q) integer_16 p,q; {
	register integer_16 a1,am; integer_16 ae,d11_19;
	am=stc_dman[p]; ae=stc_dexp[p]; a1=am*100+ae;

	/* １１..１９は本プログラムでは基本数詞扱いであるが、ここでは複合数詞とみなす。*/
	d11_19=(am>=11 && am<=19 && ae==1 ? 1:0);

	if((ae==3 && am>=1) || ACC2499(am,ae)){
		ACC000H(p); ACC0005(q); return;
	}

	if((d11_19==0 && a1==300) || a1==400 || a1==500 || a1==900){
		ACC000H(p); ACC0001(q);
	}else{
		if(ae>=5 && am>=1){
			/* 20万,200万,2000万,20億..*/
			ACC0002(p);
			accent0[stc_out_ptr[q]-1]=1;
			accent0[stc_out_ptr[q]-2]=0x82;
			ACC0004(q);
		}else{
			/* 数字は尾高化、助数詞は低く付く。*/
			ACC0002(p); ACC0004(q);
		}
	}
}

/*========== ACC2463(p,q) ==================================================
	機能：ｑ番目の助数詞は、ｐ番目の数字と相互影響して、６３型の結合をする

	　即ち、原則として、数字は尾高化し、助数詞は低く付く。
	但し、単独の三、及び、四・五、及び、
	千・万・億・兆に、一〜九・十・百・千・数・何・幾がついた場合には、
	数字は平板化し、助数詞は高く付いて、全体は平板型となる。
	　複合数詞の最後の三で、三の第一拍が高い時は、二拍目が落ちて助数詞は低く付く。
	１３に付いた場合は例外的に中高となる。
	　十万・百万・千万・十億・百億・千億・十兆・百兆・千兆の倍数は
	最後の拍が落ちる中高型となる。

		（例）段、年
  ==========================================================================*/
void ACC2463(p,q) integer_16 p,q; {
	register integer_16 a1,am; integer_16 ae,pp,pl,complex,d11_19;
	pp=phrase_ptr[p]; pl=phrase_len[p];
	am=stc_dman[p]; ae=stc_dexp[p]; a1=am*100+ae;

	if((ae==3 && am>=1) || ACC2499(am,ae)){
		ACC000H(p); ACC0005(q); return;
	}

	/************************************************************************/
	/*																		*/
	/*	複合数詞になったとき、高く付くか低く付くかを調べるには、直前の拍の	*/
	/*	高さを調べればよい。即ち、直前の拍が高ければ高く付き、低ければ		*/
	/*	低く付く。															*/
	/*																		*/
	/************************************************************************/

	/* 単独数字なら０、複合数字なら１ */
	complex=(p>0 && stc_kind[p-1]==DICKIND_D ? 1:0);
	/* １１..１９は特別扱い。*/
	d11_19=(am>=11 && am<=19 && ae==1 ? 1:0);

	/*
	 * ３・４（ヨ）・５・９（ク）は全体が平板化する。
	 * １・２・４（ヨン）・６・７・８・９（キュー）は尾高化し助数詞は低く付く。
	 */
	if(complex==0 && ae==0){
		if(am==3||am==5||((am==4||am==9)&& stc_out_len[q-1]==1)){
			goto ACC2463_HEIBAN;
		}else{
			goto ACC2463_ODAKA;
		}
	}

	/*
	 * １４（ジューヨ）・１５・１９（ジューク）は頭高化し、助数詞は低く付く。
	 * １４（ジューヨン）・１９（ジューキュー）、および、
	 * １１・１２・１３・１６・１７・１８は尾高化し、助数詞は低く付く。
	 */
	if(d11_19){
		if(((am==14||am==19)&& stc_out_len[q-1]==3)||am==15){
			goto ACC2463_ATAMA;
		}else{
			goto ACC2463_ODAKA;
		}
	}

	/* ２１以上 */
	/************************************************************************/
	/*			ここでの処理は <ACC2300> 参照のこと							*/
	/*	　複合数詞に助数詞が付いた場合のアクセント結合順序は、助数詞が先で、*/
	/*	数詞の方は後である。しかしながら、助数詞の結合には複合数詞の結果が	*/
	/*	必要である。従って、このような面倒な処理が必要になる。				*/
	/*	　数詞のアクセント結合順序は、いろいろと問題があるので、今後の		*/
	/*	検討の結果、ここでの処理は大幅に変更される可能性がある。			*/
	/************************************************************************/
	/* 前が１０００以上で後の最終拍が低ければ、助数詞は低く付く。*/
	/* 前が１０００以上で後の最終拍が高ければ、次へ行く。*/
	if(stc_dexp[p-1]>=3){
		if(accent0[pp+pl-1]==1){
			goto ACC2463_ODAKA;
		}else{
			goto ACC2463_300;
		}
	}
	/* 前が頭高ならば、後を尾高化し助数詞は低く付く。*/
	if(accent0[pp-stc_out_len[p-1]]==0x82){ goto ACC2463_ODAKA; }
	/* 前が頭高以外で、後が平板なら次へ行く。*/
	if(chk_heiban(p)){ goto ACC2463_300; }
	/* 前が頭高以外で、後が起伏なら、後が二拍以上で最終拍が低いときだけ、助数詞は低く付く。*/
	if(pl==1||(pl>1 && accent0[pp+pl-1]!=1)){ goto ACC2463_300; }
	goto ACC2463_ODAKA;

ACC2463_300:
	/* 複合数詞の最後で三の第一拍目が高いとき二拍目が落ちて助数詞は低くなる。*/
	if(a1==300){
		if(accent0[pp-1]!=1){
			/* 複合数詞の最後で三が高くなるとき */
			/* 即ち、直前の拍が高ければ、三は高くなる。*/
			goto ACC2463_ATAMA;
		}
	}

	/* 複合数詞または単独の四、五、九は助数詞が高くなる。*/	
	/* さもなければ、数詞は尾高化し、助数詞は低くなる。*/
	/*if(complex==0 && (a1==400 || a1==500)){*/
	if(a1==400||a1==500||a1==900){
		goto ACC2463_HEIBAN;
	}else{
		if(ae>=5 && am>=1){
			/* 20万,200万,2000万,20億..*/
			ACC0002(p);
			accent0[stc_out_ptr[q]-1]=1;
			accent0[stc_out_ptr[q]-2]=0x82;
			ACC0004(q);
			return;
		}else{
			/* 数字は尾高化、助数詞は低く付く。*/
			goto ACC2463_ODAKA;
		}
	}

ACC2463_ATAMA:
	ACC0001(p); ACC0004(q); return;
ACC2463_ODAKA:
	ACC0002(p); ACC0004(q); return;
ACC2463_HEIBAN:
	ACC000H(p); ACC0005(q); return;
}


/*========== ACC2499(am,ae) ==================================================
	機能：千・万・億・兆に、数・何・幾・一〜九・十・百・千がついた場合かどうかを
		調べる。

	値：　数千・数万・数億・数兆、
		　一千〜九千・一万〜九万・一億〜九億・一兆〜九兆　および
		　十万・百万・千万・十億・百億・千億・十兆・百兆・千兆　のとき１を返す。
		　千・数十万・数百万・二十万・一千万・一千億　などのときは、０を返す。
  ==========================================================================*/
BOOL ACC2499(am,ae) register integer_16 am,ae; {
	/* １０００未満の数字はゼロを返す。*/
	if(ae<=2){ return 0; }
	/* 一万〜九万・一億〜九億・一兆〜九兆 */
	if(ae==4 || ae==8 || ae==12){ return 1; }
	/* 一千〜九千 （千を除く）*/
	if(ae==3 && am>=1){ return 1; }
	/* 十万・百万・千万・十億・百億・千億・十兆・百兆・千兆 */
	if(am==0 && ae>=5){ return 1; }
	return 0;
}

/***************************** END OF ACC_24XX.C *****************************/
