/********************************************
	ILE_MJZH.H	updated at 19th July 1988
	文字属性
 ********************************************/

/* 文字属性対応表レコード定義 */
#define	MjzBitToji	0x80	/* 閉括弧(先頭になりえない文字：特殊文字２) */
#define	MjzBitDigit	0x08	/* 数字(英数字) */
#define	MjzBitSoku	0x04	/* 促音・撥音(平仮名・片仮名) */
#define	MjzBitHido	0x02	/* 非独立文字(ぁぃぅぇぉゃゅょー)(平仮名・片仮名) */

/*========== MjzfGetChrAttr(r) ======================================
	機能：rにあるＪＩＳ漢字コード第２バイトに対応する文字属性を返す。
  ===================================================================*/
#define	MjzfGetChrAttr(r)		FddHDR[Fdd_Header.Fdd_ChrAttrOfs+r]

/*========== MjzfToku1(r) =======================
	機能：文字属性rが特殊文字１かどうかを調べる。
  ===============================================*/
#define	MjzfToku1(r)			((r & MjzBitToji)==0)

/*========== MjzfDigit(r) =================
	機能：文字属性rが数字かどうかを調べる。
  =========================================*/
#define	MjzfDigit(r)			(r & MjzBitDigit)

/*========== MjzfHido(r) ========================
	機能：文字属性rが非独立文字かどうかを調べる。
  ===============================================*/
#define	MjzfHido(r)				(r & MjzBitHido)

/*========== MjzfSoku(r) ============================
	機能：文字属性rが促音または撥音かどうかを調べる。
  ===================================================*/
#define	MjzfSoku(r)				(r & MjzBitSoku)

/***************************** END OF ILE_MJZH.H *****************************/
